Aquawhite/LM3S5R31-TwinWeigher/New Twin Weigher V1.0.c
#define PORT_GT_INFPUSHPNEU_VALVE_BASE	GPIO_PORTJ_BASE
#define PORT_GT_INFPUSHPNEU_VALVE_PIN	GPIO_PIN_0
#define PIN_BTN_STOP_BASE				GPIO_PORTJ_BASE
#define	PIN_BTN_STOP_PIN				GPIO_PIN_1
#define PORT_W_ROPGATEPNEU_VALVE_BASE	GPIO_PORTJ_BASE
#define PORT_W_ROPGATEPNEU_VALVE_PIN	GPIO_PIN_2

#define UARTDISABLEDCOUNT			1000

/* Communication : TouchScreen */
// Operation Page
/* System Variable */
unsigned char MachineRunning, ServiceMode, LastServiceMode, MachineStopping;
unsigned char IgnoreAirError, NoAirErrorMsg, NoAirErrorMsgDuration, NoAirError;
unsigned char FoilJam, FoilJamMsgDuration, FoilJamMsg;
unsigned int FoilJamCounter, NoAirErrorCounter;
unsigned char ProductCountBit, ProductCountBitCounter;
unsigned char EyemarkLampCounter, EyemarkON, EyemarkEnable;
unsigned int CounterEyemarkIgnore;
unsigned char RunBtn, StopBtn, LastRunBtn, LastStopBtn, StopCommand;
unsigned char Error, FatalError;
unsigned char DoorOpen, EyemarkError, FoilEmpty, DatesensError;
unsigned char HMICurrentWindow, HMILastWindow;

unsigned char TRSbsMode, GTSbsMode, OFSbsMode, SPSbsMode;
unsigned char TRModMode, GTModMode, OFModMode, SPModMode;

unsigned long int LifeDuration, longintdelay;
unsigned int BufferSensor;
/* Communication Data Declaration */
unsigned int  ReadACKCounter = 1000;
unsigned char dataIndex = 0, dataRXIndex = 0, dataTXIndex = 0;
unsigned char  ComAddress = 0, BytestoRead = 0;
unsigned char ComOUT[110], ComIN[110];
tBoolean ComDirection = FALSE, ComEnable = FALSE, DoubleSpeed = FALSE, UARTDisabled = FALSE;
unsigned char DataTimerTrigger = FALSE, DataLock = FALSE, DataReady = FALSE, ReadACK = FALSE;
unsigned char TransferIdle = FALSE, ReceiveIdle = FALSE;
unsigned int  IntTXCounter = 0, IntRXCounter = 0;
unsigned long int DataTimerCounter = 0;
unsigned int  UARTTimeOut = UARTDISABLEDCOUNT, UARTDisabledCounter = 0;

unsigned char SlavePortA, SlavePortB, SlavePortC, SlavePortD;
unsigned char SlavePortE, SlavePortF, SlavePortG, SlavePortH;
unsigned char SlavePortI, SlavePortJ;

tBoolean blinkFlag = FALSE, ComFlag;
unsigned char BlinkCom;
unsigned int blinkON, blinkOFF;

/* Saved Data */
unsigned long int ProductCounterepr;
unsigned long int Eepromsave = 1000000;
unsigned char autosaveflag;
// Communication SPI
unsigned long SPIOut[26], SPIIn[26];
unsigned char SPICounter, SPIReiterationCounterIN, SPIReiterationCounterOUT, SPICounterSkip;
unsigned char SPIDataLock, SPIDataReady, SPIReiterationMode;                            // bit
unsigned char SPIHeaterON1, SPIHeaterON2, SPIHeaterON3, SPIHeaterON4;
unsigned char SPIInTEST, SPIOutTEST, SPIStartTimer = 250;
unsigned int  SPITimerCounter = 0;
unsigned char SPIComErrorFlag, SPIComError;
unsigned int  SPIComErrorCounter;
unsigned char SPITransmitted = FALSE;
/* Timer Variables */
unsigned char ms10counter, ms100counter;

/* Loop Analyze */
unsigned int LoopCycle, LoopTime;

/* Infeed Table Module */
unsigned int ITTrayPosLeftSensor, ITTrayPosRightSensor, ITTrayElevationMaxSensor, ITTrayElevationMinSensor;
unsigned int ITMaterialAvailableSensor, ITMaterialAvailableSensor2;

unsigned char ITMotorTrayElevator, ITMotorTrayElevatorMON, ITMotorTrayElevatorDir, ITMotorTrayElevatorDirMON;
unsigned char ITValveTrayPos, ITValveTrayPosMON;

unsigned char ITEnable, ITMotorTrayElevatorDirSet, ITReady, ITSwitchTrayStep;
unsigned char DirUP, DirDOWN;

/* Transfer & Reorient Module */
unsigned int TRExtenderPneuExtSensor, TRExtenderPneuRetSensor, TRReorientPneuExtSensor;
unsigned int TRReorientPneuRetSensor, TRVacuumSensor;

unsigned char TRExtenderPneuValve, TRExtenderPneuValveMON, TRReorientPneuValve,	TRReorientPneuValveMON;
unsigned char TRVacuumValve, TRVacuumValveMON, TRFoilPusherValve, TRFoilPusherValveMON;
unsigned char TRModuleStep, TRModuleWaiting;
unsigned int TRVacuumValveDelay, TRVacuumValveDelayCounter;
unsigned char TRSbsMON, LastTRSbsMON, TRModMON, LastTRModMON;

/* Grip & Transfer */
unsigned int GTInFillGripPneuLRetSensor, GTInFillGripPneuRRetSensor, GTOutFillOpenPneuLRetSensor;
unsigned int GTOutFillOpenPneuRRetSensor, GTOutFillOpenPneuLExtSensor, GTOutFillOpenPneuRExtSensor;
unsigned int GTOutFillGripPneuLRetSensor, GTOutFillGripPneuRRetSensor, GTTransferPneuRetSensor;
unsigned int GTTransferPneuExtSensor;

unsigned char GTInFillGripPneuValve, GTInFillGripPneuValveMON, GTOutFillOpenPneuValve, GTOutFillOpenPneuValveMON;
unsigned char GTOutFillGripPneuValve, GTOutFillGripPneuValveMON, GTTransferPneuValve, GTTransferPneuValveMON;

unsigned char GTModuleStep, GTSA1ModuleWaiting, GTSA2ModuleWaiting, GTRequestFilling;
unsigned int GTCloseBagDelay, GTCloseBagDelayCounter, GTBothOpenGripDelay, GTBothOpenGripDelayCounter;
unsigned char GTFirstCycle = TRUE;

unsigned char GTFPushPneuValve;
unsigned int GTFPushPneuValveDuration, GTFPushPneuValveDurationCounter;

unsigned char GTSbsMON, LastGTSbsMON, GTModMON, LastGTModMON;
/* Filling Module & Vibrator Filling Module */
unsigned int OFGatePneuRetSensor, OFGatePneuExtSensor, OFEngagePneuRetSensor, OFEngagePneuExtSensor;
unsigned int OFOpenPneuRRetSensor, OFOpenPneuLRetSensor, OFOpenPneuRExtSensor, OFOpenPneuLExtSensor;
unsigned int OFVacuumSensor;
unsigned int VFVibEngagePneuRetSensor, VFVibEngagePneuExtSensor;

unsigned char OFGatePneuValve, OFGatePneuValveMON, OFEngagePneuValve, OFEngagePneuValveMON;
unsigned char OFOpenPneuValve, OFOpenPneuValveMON, OFVacuumValve, OFVacuumValveMON;
unsigned char VFVibEngagePneuValve, VFVibEngagePneuValveMON, VFVibrator, VFVibratorMON;

unsigned int OFGatePneuValveDuration, OFVacuumValveDelay, OFGatePneuValveDurationCounter, OFVacuumValveDelayCounter;
unsigned char OFGatePneuFilled, OFGatePneuFillingProcess;

unsigned char OFModuleStep, OFModuleWaiting;
unsigned char OFSbsMON, LastOFSbsMON, OFModMON, LastOFModMON;

unsigned char OFRequestFilling;

/* Sealing Module & Vibrator Sealer Module */
unsigned int SPSealerPneuRetSensor, SPSealerPneuExtSensor, SPVibEngagePneuRetSensor, SPVibEngagePneuExtSensor;
unsigned int SPPusherPneuRetSensor, SPPusherPneuExtSensor;

unsigned char SPSealerPneuValve, SPSealerPneuValveMON, SPVibEngagePneuValve, SPVibEngagePneuValveMON;
unsigned char SPPusherValve, SPPusherValveMON, SPVibrator, SPVibratorMON;

unsigned int SPSealerPneuValveDuration,	SPSealerPneuValveDelay, SPSealerPneuValveDurationCounter, SPSealerPneuValveDelayCounter;
unsigned char SPModuleStep;

