Aquawhite/LM3S5R31-TwinWeigher/New Twin Weigher V1.0.c
	                    		// RIGHT LOADCELL
	                    		// If going from Calibration page 1 -> page 2
	                    		if((HMICurrentWindow == 39) && (HMILastWindow == 38) )
	                    			WLCRCalibrationMode = 1;
	                    		// If going from Calibration page 2 -> Main Calibration Page
	                    		if((HMICurrentWindow == 40) && (HMILastWindow == 39) )
	                    			WLCRCalibrationMode = 2;
	                    	}
	                    	HMILastWindow = HMICurrentWindow;
	                    }
	                    break;
	                case 52:
	                    if(ComAddress == 1)
	                    {
	                    	GTFPushPneuValveDuration = ComIN[52] * 10;
	                    }
	                    break;
	                case 54:
	                    if(ComAddress == 1)
	                    {
	                    	BufferSensor = (ComIN[53] << 8) + ComIN[54];
	                    }
	                    break;
	                case 90:	// case 90 - 98 is for Direct PORTOUT  PORTA = 90, PORTJ = 98
	                    if(ComAddress == 1)
	                    {
	                        if(!MachineRunning)
	                        {

	                        }
	                    }
	                    break;
	                case 91:	// PORTB
	                    if(ComAddress == 1)
	                    {
	                        if(!MachineRunning)
	                        {

	                        }
	                    }
	                    break;
	                case 92:	// PORTC
	                    if(ComAddress == 1)
	                    {
	                        if(!MachineRunning)
	                        {

	                        }
	                    }
	                    break;
	                case 93:	// PORTD
	                    if(ComAddress == 1)
	                    {

	                    }
	                    break;
	                case 96:	// PORTG
	                    if(ComAddress == 1)
	                    {

	                    }
	                    break;
	                case 98:	// PORTJ
	                    if(ComAddress == 1)
	                    {
	                        if(!MachineRunning)
	                        {

	                        }
	                    }
	                    break;
	                case 99:
	                    if(ComAddress == 1)
	                    {
	                    }
	                    break;
	                case 101:
	                    if(ComAddress == 1)
	                    {
	                    }
	                    break;

	            }
				if(dataRXIndex == 109)
				{
					UARTTimeOut = UARTDISABLEDCOUNT;
                    ComAddress = ComIN[3];
                    BytestoRead = ComIN[4];
					ReadACK = TRUE;
					dataTXIndex = ComAddress * 20;
					dataRXIndex = 0;
	                //ROM_UARTCharPutNonBlocking(UART0_BASE, ComOUT[dataTXIndex]);
	                //dataTXIndex++;
					IntRXCounter++;
					ComFlag = TRUE;                         // Have communicated with TouchScreen Successfully
				}

				if( (ComIN[0] != 0xF0) || (ReadACK == TRUE) )
				{
					dataRXIndex = 0;
					//debugcounter1++;
				}
				else
					dataRXIndex++;
			}
		}
    }


    // Interrupt Transmit Handler
    if( (ulStatus & UART_INT_TX) == UART_INT_TX )
    {
    }
}

//*****************************************************************************
// Interrupt handler for the LD_DATA interrupt
//*****************************************************************************
void IntGPIOd(void)
{
	ROM_GPIOPinIntClear(PIN_W_LCR_DATA_BASE, PIN_W_LCR_DATA_PIN);
    if(WLCRWaitingMode)
    	WLCRWaitingMode = FALSE;
}
void IntGPIOe(void)
{
	ROM_GPIOPinIntClear(PIN_W_LCL_DATA_BASE, PIN_W_LCL_DATA_PIN);
    if(WLCLWaitingMode)
    	WLCLWaitingMode = FALSE;
}

//*****************************************************************************
// Interrupt handler for the Timer0 interrupt
//*****************************************************************************
void Timer0IntHandler(void)
{

    // Clear the timer interrupt.
    TimerIntClear(TIMER0_BASE, TIMER_TIMA_TIMEOUT);

    LoopTime = LoopCycle;
    LoopCycle = 0;

    // STEP BY STEP MODE
	//StepbyStepMode SBSMode
	if(TRSbsMON)
	{
		if(TRModuleStep == 7)
			TRModuleStep = 0;
		else
			TRModuleStep++;

		TRSbsMode = TRUE;
		TRSbsMON = FALSE;
	}
	if(GTSbsMON)
	{
		if(GTModuleStep == 9)
			GTModuleStep = 0;
		else
			GTModuleStep++;

		GTSbsMode = TRUE;
		GTSbsMON = FALSE;
	}
	if(OFSbsMON)
	{
		if(OFModuleStep == 8)
			OFModuleStep = 0;
		else
			OFModuleStep++;

		OFSbsMode = TRUE;
		OFSbsMON = FALSE;
	}
	if(SPSbsMON)
	{
		if(SPModuleStep == 7)
			SPModuleStep = 0;
		else
			SPModuleStep++;

		SPSbsMode = TRUE;
		SPSbsMON = FALSE;
	}

	// Modular Mode
	if(TRModMON)
	{
		if(TRModuleStep == 7)
			TRModuleStep = 0;
		else
			TRModuleStep++;

		TRModMode = TRUE;
		TRModMON = FALSE;
	}
	if(GTModMON)
	{
		if(GTModuleStep == 9)
			GTModuleStep = 0;
		else
			GTModuleStep++;

		GTModMode = TRUE;
		GTModMON = FALSE;
	}
	if(OFModMON)
	{
		if(OFModuleStep == 8)
			OFModuleStep = 0;
		else
			OFModuleStep++;

		OFModMode = TRUE;
		OFModMON = FALSE;
	}
	if(SPModMON)
	{
		if(SPModuleStep == 7)
			SPModuleStep = 0;
		else
			SPModuleStep++;

		SPModMode = TRUE;
		SPModMON = FALSE;
	}

    /* Coiling to PORT */
    if(!MachineRunning && ServiceMode)
    {	// IT Module is controlled by SLAVE
    	ITMotorTrayElevator = ITMotorTrayElevatorMON;
    	ITMotorTrayElevatorDir = ITMotorTrayElevatorDirMON;
    	ITValveTrayPos = ITValveTrayPosMON;

    	if(TRExtenderPneuValveMON)
    		ROM_GPIOPinWrite(PORT_TR_EXTPNEU_VALVE_BASE, PORT_TR_EXTPNEU_VALVE_PIN, PORT_TR_EXTPNEU_VALVE_PIN);
    	else
    		ROM_GPIOPinWrite(PORT_TR_EXTPNEU_VALVE_BASE, PORT_TR_EXTPNEU_VALVE_PIN, 0);
    	if(TRReorientPneuValveMON)
    		ROM_GPIOPinWrite(PORT_TR_REOPNEU_VALVE_BASE, PORT_TR_REOPNEU_VALVE_PIN, PORT_TR_REOPNEU_VALVE_PIN);
    	else
    		ROM_GPIOPinWrite(PORT_TR_REOPNEU_VALVE_BASE, PORT_TR_REOPNEU_VALVE_PIN, 0);
    	if(TRVacuumValveMON)
    		ROM_GPIOPinWrite(PORT_TR_VACUUM_BASE, PORT_TR_VACUUM_PIN, PORT_TR_VACUUM_PIN);
    	else
    		ROM_GPIOPinWrite(PORT_TR_VACUUM_BASE, PORT_TR_VACUUM_PIN, 0);
    	if(TRFoilPusherValveMON)
    		ROM_GPIOPinWrite(PORT_GT_INFPUSHPNEU_VALVE_BASE, PORT_GT_INFPUSHPNEU_VALVE_PIN, PORT_GT_INFPUSHPNEU_VALVE_PIN);
    	else
    		ROM_GPIOPinWrite(PORT_GT_INFPUSHPNEU_VALVE_BASE, PORT_GT_INFPUSHPNEU_VALVE_PIN, 0);

    	// GT Module is controlled by SLAVE
    	GTInFillGripPneuValve = GTInFillGripPneuValveMON;
    	GTOutFillOpenPneuValve = GTOutFillOpenPneuValveMON;
    	GTOutFillGripPneuValve = GTOutFillGripPneuValveMON;
    	GTTransferPneuValve = GTTransferPneuValveMON;

    	if(OFGatePneuValveMON)
    		ROM_GPIOPinWrite(PORT_OF_GATEPNEU_VALVE_BASE, PORT_OF_GATEPNEU_VALVE_PIN, PORT_OF_GATEPNEU_VALVE_PIN);
    	else
    		ROM_GPIOPinWrite(PORT_OF_GATEPNEU_VALVE_BASE, PORT_OF_GATEPNEU_VALVE_PIN, 0);
    	if(OFEngagePneuValveMON)
    		ROM_GPIOPinWrite(PORT_OF_ENGAGEPNEU_VALVE_BASE, PORT_OF_ENGAGEPNEU_VALVE_PIN, PORT_OF_ENGAGEPNEU_VALVE_PIN);
    	else
    		ROM_GPIOPinWrite(PORT_OF_ENGAGEPNEU_VALVE_BASE, PORT_OF_ENGAGEPNEU_VALVE_PIN, 0);
    	if(OFOpenPneuValveMON)
    		ROM_GPIOPinWrite(PORT_OF_OPENPNEU_VALVE_BASE, PORT_OF_OPENPNEU_VALVE_PIN, PORT_OF_OPENPNEU_VALVE_PIN);
    	else
    		ROM_GPIOPinWrite(PORT_OF_OPENPNEU_VALVE_BASE, PORT_OF_OPENPNEU_VALVE_PIN, 0);
    	if(OFVacuumValveMON)
    		ROM_GPIOPinWrite(PORT_OF_VACUUM_BASE, PORT_OF_VACUUM_PIN, PORT_OF_VACUUM_PIN);
    	else
    		ROM_GPIOPinWrite(PORT_OF_VACUUM_BASE, PORT_OF_VACUUM_PIN, 0);

