Aquawhite/LM3S5R31-TwinWeigher/New Twin Weigher V1.0.c
    	// Vibrator Filling Module is controlled by SLAVE
    	VFVibEngagePneuValve = VFVibEngagePneuValveMON;
    	VFVibrator = VFVibratorMON;

    	if(SPSealerPneuValveMON)
    		ROM_GPIOPinWrite(PORT_SP_SEALERPNEU_VALVE_BASE, PORT_SP_SEALERPNEU_VALVE_PIN, PORT_SP_SEALERPNEU_VALVE_PIN);
    	else
    		ROM_GPIOPinWrite(PORT_SP_SEALERPNEU_VALVE_BASE, PORT_SP_SEALERPNEU_VALVE_PIN, 0);

    	// Vibrator Sealer Module is controller by SLAVE
    	SPVibEngagePneuValve = SPVibEngagePneuValveMON;
    	SPPusherValve = SPPusherValveMON;
    	SPVibrator = SPVibratorMON;

    	if(WLLrGatePneuValveMON)
			ROM_GPIOPinWrite(PORT_W_LLRGATEPNEU_VALVE_BASE, PORT_W_LLRGATEPNEU_VALVE_PIN, PORT_W_LLRGATEPNEU_VALVE_PIN);
		else
			ROM_GPIOPinWrite(PORT_W_LLRGATEPNEU_VALVE_BASE, PORT_W_LLRGATEPNEU_VALVE_PIN, 0);
		if(WLSmGatePneuValveMON)
			ROM_GPIOPinWrite(PORT_W_LSMGATEPNEU_VALVE_BASE, PORT_W_LSMGATEPNEU_VALVE_PIN, PORT_W_LSMGATEPNEU_VALVE_PIN);
		else
			ROM_GPIOPinWrite(PORT_W_LSMGATEPNEU_VALVE_BASE, PORT_W_LSMGATEPNEU_VALVE_PIN, 0);
		if(WLOpGatePneuValveMON)
			ROM_GPIOPinWrite(PORT_W_LOPGATEPNEU_VALVE_BASE, PORT_W_LOPGATEPNEU_VALVE_PIN, PORT_W_LOPGATEPNEU_VALVE_PIN);
		else
			ROM_GPIOPinWrite(PORT_W_LOPGATEPNEU_VALVE_BASE, PORT_W_LOPGATEPNEU_VALVE_PIN, 0);

		if(WRLrGatePneuValveMON)
			ROM_GPIOPinWrite(PORT_W_RLRGATEPNEU_VALVE_BASE, PORT_W_RLRGATEPNEU_VALVE_PIN, PORT_W_RLRGATEPNEU_VALVE_PIN);
		else
			ROM_GPIOPinWrite(PORT_W_RLRGATEPNEU_VALVE_BASE, PORT_W_RLRGATEPNEU_VALVE_PIN, 0);
		if(WRSmGatePneuValveMON)
			ROM_GPIOPinWrite(PORT_W_RSMGATEPNEU_VALVE_BASE, PORT_W_RSMGATEPNEU_VALVE_PIN, PORT_W_RSMGATEPNEU_VALVE_PIN);
		else
			ROM_GPIOPinWrite(PORT_W_RSMGATEPNEU_VALVE_BASE, PORT_W_RSMGATEPNEU_VALVE_PIN, 0);
		if(WROpGatePneuValveMON)
			ROM_GPIOPinWrite(PORT_W_ROPGATEPNEU_VALVE_BASE, PORT_W_ROPGATEPNEU_VALVE_PIN, PORT_W_ROPGATEPNEU_VALVE_PIN);
		else
			ROM_GPIOPinWrite(PORT_W_ROPGATEPNEU_VALVE_BASE, PORT_W_ROPGATEPNEU_VALVE_PIN, 0);
    }
    if(LastServiceMode != ServiceMode)		// if servicemode just turned off, back to standby position
    {
    	if(!ServiceMode)
    	{
    		// IT Module
    		ITMotorTrayElevator = FALSE;
			//ITMotorTrayElevatorDir = ITMotorTrayElevatorDirMON;
			//ITValveTrayPos = ITValveTrayPosMON;

    		// TR Module
			ROM_GPIOPinWrite(PORT_TR_EXTPNEU_VALVE_BASE, PORT_TR_EXTPNEU_VALVE_PIN, 0);
			ROM_GPIOPinWrite(PORT_TR_REOPNEU_VALVE_BASE, PORT_TR_REOPNEU_VALVE_PIN, 0);
			ROM_GPIOPinWrite(PORT_TR_VACUUM_BASE, PORT_TR_VACUUM_PIN, 0);

			ROM_GPIOPinWrite(PORT_GT_INFPUSHPNEU_VALVE_BASE, PORT_GT_INFPUSHPNEU_VALVE_PIN, 0);

			// GT Module
			GTInFillGripPneuValve = TRUE;	// Grip Open
			GTTransferPneuValve = FALSE;
			GTOutFillOpenPneuValve = FALSE;
			GTOutFillGripPneuValve = TRUE;	// Grip Open

			// OF Module
			ROM_GPIOPinWrite(PORT_OF_GATEPNEU_VALVE_BASE, PORT_OF_GATEPNEU_VALVE_PIN, 0);
			ROM_GPIOPinWrite(PORT_OF_ENGAGEPNEU_VALVE_BASE, PORT_OF_ENGAGEPNEU_VALVE_PIN, 0);
			ROM_GPIOPinWrite(PORT_OF_OPENPNEU_VALVE_BASE, PORT_OF_OPENPNEU_VALVE_PIN, 0);
			ROM_GPIOPinWrite(PIN_OF_VACUUM_SENSOR_BASE, PIN_OF_VACUUM_SENSOR_PIN, 0);
	    	VFVibEngagePneuValve = FALSE;
	    	VFVibrator = FALSE;

	    	// SP Module
			ROM_GPIOPinWrite(PORT_SP_SEALERPNEU_VALVE_BASE, PORT_SP_SEALERPNEU_VALVE_PIN, 0);
			SPVibEngagePneuValve = FALSE;
			SPPusherValve = FALSE;
			SPVibrator = FALSE;

			// W Module
			ROM_GPIOPinWrite(PORT_W_LLRGATEPNEU_VALVE_BASE, PORT_W_LLRGATEPNEU_VALVE_PIN, 0);
			ROM_GPIOPinWrite(PORT_W_LSMGATEPNEU_VALVE_BASE, PORT_W_LSMGATEPNEU_VALVE_PIN, 0);
			ROM_GPIOPinWrite(PORT_W_LOPGATEPNEU_VALVE_BASE, PORT_W_LOPGATEPNEU_VALVE_PIN, 0);

			ROM_GPIOPinWrite(PORT_W_RLRGATEPNEU_VALVE_BASE, PORT_W_RLRGATEPNEU_VALVE_PIN, 0);
			ROM_GPIOPinWrite(PORT_W_RSMGATEPNEU_VALVE_BASE, PORT_W_RSMGATEPNEU_VALVE_PIN, 0);
			ROM_GPIOPinWrite(PORT_W_ROPGATEPNEU_VALVE_BASE, PORT_W_ROPGATEPNEU_VALVE_PIN, 0);
    	}
    }
    LastServiceMode = ServiceMode;

    /* Outputs that need to be controlled indepently
    if(!MachineRunning)
    {
    	if(PRRollerValveON)
    		ROM_GPIOPinWrite(PORT_PULLROLL_VALVE_BASE, PORT_PULLROLL_VALVE_PIN, PORT_PULLROLL_VALVE_PIN);
    	else
    		ROM_GPIOPinWrite(PORT_PULLROLL_VALVE_BASE, PORT_PULLROLL_VALVE_PIN, 0);
    }
	  Outputs that need to be controlled indepently */

    // When Machine Running
    if(!ServiceMode)
    {
    	// Skip ALL SLAVES I/O
    	if(TRExtenderPneuValve)
    		ROM_GPIOPinWrite(PORT_TR_EXTPNEU_VALVE_BASE, PORT_TR_EXTPNEU_VALVE_PIN, PORT_TR_EXTPNEU_VALVE_PIN);
    	else
    		ROM_GPIOPinWrite(PORT_TR_EXTPNEU_VALVE_BASE, PORT_TR_EXTPNEU_VALVE_PIN, 0);
    	if(TRReorientPneuValve)
    		ROM_GPIOPinWrite(PORT_TR_REOPNEU_VALVE_BASE, PORT_TR_REOPNEU_VALVE_PIN, PORT_TR_REOPNEU_VALVE_PIN);
    	else
    		ROM_GPIOPinWrite(PORT_TR_REOPNEU_VALVE_BASE, PORT_TR_REOPNEU_VALVE_PIN, 0);
    	if(TRVacuumValve)
    		ROM_GPIOPinWrite(PORT_TR_VACUUM_BASE, PORT_TR_VACUUM_PIN, PORT_TR_VACUUM_PIN);
    	else
    		ROM_GPIOPinWrite(PORT_TR_VACUUM_BASE, PORT_TR_VACUUM_PIN, 0);
    	if(GTFPushPneuValve)
    		ROM_GPIOPinWrite(PORT_GT_INFPUSHPNEU_VALVE_BASE, PORT_GT_INFPUSHPNEU_VALVE_PIN, PORT_GT_INFPUSHPNEU_VALVE_PIN);
    	else
    		ROM_GPIOPinWrite(PORT_GT_INFPUSHPNEU_VALVE_BASE, PORT_GT_INFPUSHPNEU_VALVE_PIN, 0);

    	// Filling
    	if(OFGatePneuValve)
    		ROM_GPIOPinWrite(PORT_OF_GATEPNEU_VALVE_BASE, PORT_OF_GATEPNEU_VALVE_PIN, PORT_OF_GATEPNEU_VALVE_PIN);
    	else
    		ROM_GPIOPinWrite(PORT_OF_GATEPNEU_VALVE_BASE, PORT_OF_GATEPNEU_VALVE_PIN, 0);
    	if(OFEngagePneuValve)
    		ROM_GPIOPinWrite(PORT_OF_ENGAGEPNEU_VALVE_BASE, PORT_OF_ENGAGEPNEU_VALVE_PIN, PORT_OF_ENGAGEPNEU_VALVE_PIN);
    	else
    		ROM_GPIOPinWrite(PORT_OF_ENGAGEPNEU_VALVE_BASE, PORT_OF_ENGAGEPNEU_VALVE_PIN, 0);
    	if(OFOpenPneuValve)
    		ROM_GPIOPinWrite(PORT_OF_OPENPNEU_VALVE_BASE, PORT_OF_OPENPNEU_VALVE_PIN, PORT_OF_OPENPNEU_VALVE_PIN);
    	else
    		ROM_GPIOPinWrite(PORT_OF_OPENPNEU_VALVE_BASE, PORT_OF_OPENPNEU_VALVE_PIN, 0);
    	if(OFVacuumValve)
    		ROM_GPIOPinWrite(PORT_OF_VACUUM_BASE, PORT_OF_VACUUM_PIN, PORT_OF_VACUUM_PIN);
    	else
    		ROM_GPIOPinWrite(PORT_OF_VACUUM_BASE, PORT_OF_VACUUM_PIN, 0);

    	// Sealing
    	if(SPSealerPneuValve)
    		ROM_GPIOPinWrite(PORT_SP_SEALERPNEU_VALVE_BASE, PORT_SP_SEALERPNEU_VALVE_PIN, PORT_SP_SEALERPNEU_VALVE_PIN);
    	else
    		ROM_GPIOPinWrite(PORT_SP_SEALERPNEU_VALVE_BASE, PORT_SP_SEALERPNEU_VALVE_PIN, 0);

    	//Weigher
    	if(WRLrGatePneuValve)
			ROM_GPIOPinWrite(PORT_W_RLRGATEPNEU_VALVE_BASE, PORT_W_RLRGATEPNEU_VALVE_PIN, PORT_W_RLRGATEPNEU_VALVE_PIN);
		else
			ROM_GPIOPinWrite(PORT_W_RLRGATEPNEU_VALVE_BASE, PORT_W_RLRGATEPNEU_VALVE_PIN, 0);
		if(WRSmGatePneuValve)
			ROM_GPIOPinWrite(PORT_W_RSMGATEPNEU_VALVE_BASE, PORT_W_RSMGATEPNEU_VALVE_PIN, PORT_W_RSMGATEPNEU_VALVE_PIN);
		else
			ROM_GPIOPinWrite(PORT_W_RSMGATEPNEU_VALVE_BASE, PORT_W_RSMGATEPNEU_VALVE_PIN, 0);
		if(WROpGatePneuValve)
			ROM_GPIOPinWrite(PORT_W_ROPGATEPNEU_VALVE_BASE, PORT_W_ROPGATEPNEU_VALVE_PIN, PORT_W_ROPGATEPNEU_VALVE_PIN);
		else
			ROM_GPIOPinWrite(PORT_W_ROPGATEPNEU_VALVE_BASE, PORT_W_ROPGATEPNEU_VALVE_PIN, 0);

		if(WLLrGatePneuValve)
			ROM_GPIOPinWrite(PORT_W_LLRGATEPNEU_VALVE_BASE, PORT_W_LLRGATEPNEU_VALVE_PIN, PORT_W_LLRGATEPNEU_VALVE_PIN);
		else
			ROM_GPIOPinWrite(PORT_W_LLRGATEPNEU_VALVE_BASE, PORT_W_LLRGATEPNEU_VALVE_PIN, 0);
		if(WLSmGatePneuValve)
			ROM_GPIOPinWrite(PORT_W_LSMGATEPNEU_VALVE_BASE, PORT_W_LSMGATEPNEU_VALVE_PIN, PORT_W_LSMGATEPNEU_VALVE_PIN);
		else
			ROM_GPIOPinWrite(PORT_W_LSMGATEPNEU_VALVE_BASE, PORT_W_LSMGATEPNEU_VALVE_PIN, 0);
		if(WLOpGatePneuValve)
			ROM_GPIOPinWrite(PORT_W_LOPGATEPNEU_VALVE_BASE, PORT_W_LOPGATEPNEU_VALVE_PIN, PORT_W_LOPGATEPNEU_VALVE_PIN);
		else
			ROM_GPIOPinWrite(PORT_W_LOPGATEPNEU_VALVE_BASE, PORT_W_LOPGATEPNEU_VALVE_PIN, 0);

