Aquawhite/LM3S5R31-TwinWeigher/New Twin Weigher V1.0.c
				// SA 2 // Request Filling and wait till Filling finished
				// Skip Filling if First Cycle or MachineStopping
				if((!GTFirstCycle) && (!MachineStopping) )
					GTRequestFilling = TRUE;

				if(!GTSbsMode)
					GTModuleStep = 5;
				else
					GTSbsMode = FALSE;
				break;
			case 5:  // SA1 : Receive the foil from TR, SA2 Filling Process
				// SA 1
				// Waiting for SA2 to finish

				// SA2 Close the bag after filling
				GTOutFillGripPneuValve = FALSE;	// Grip Still Closed
				if(!GTRequestFilling)
				{
					//GTOutFillOpenPneuValve = FALSE;	// Close the bag after filling.. need delay
					if(!GTCloseBagDelayCounter)
						GTCloseBagDelayCounter = GTCloseBagDelay + 1;
				}
				if((!GTOutFillOpenPneuLRetSensor) && (!GTOutFillOpenPneuRRetSensor))
				{
					if(!GTSbsMode)
						GTModuleStep = 6;
					else
						GTSbsMode = FALSE;
				}
				break;
			case 6:	// SA1 & SA2 change position.. TransferPneu Activated
				GTInFillGripPneuValve = FALSE;	// Grip Closed
				GTOutFillOpenPneuValve = FALSE; // Bag Closed
				GTOutFillGripPneuValve = FALSE;	// Grip Closed
				GTTransferPneuValve = TRUE;		// Shift Arm 1 go to filling position
				if(!GTTransferPneuExtSensor)
				{
					GTSA1ModuleWaiting = TRUE;
					GTSA2ModuleWaiting = TRUE;
					if(!GTSbsMode)
						GTModuleStep = 7;
					else
						GTSbsMode = FALSE;
				}
				break;
			case 7:
				// SA1 : Wait til FModule grab the foil with vacuum

				GTInFillGripPneuValve = FALSE;	// Grip still  Closed

				// SA2 : Wait till SModule Seal the bag..

				GTOutFillOpenPneuValve = FALSE; // Bag Closed
				GTOutFillGripPneuValve = FALSE;	// Grip still  Closed

				if( ((!GTSA1ModuleWaiting) && (!GTSA2ModuleWaiting)) ) //|| MachineStopping )
				{
					if(!GTSbsMode)
						GTModuleStep = 8;
					else
						GTSbsMode = FALSE;
				}
				break;
			case 8:
				// SA1 : Open the gripper
				GTInFillGripPneuValve = TRUE;	// Grip Open

				// SA2 : Open the gripper
				GTOutFillOpenPneuValve = FALSE; // Bag Closed
				GTOutFillGripPneuValve = TRUE;	// Grip Open

				GTBothOpenGripDelayCounter = GTBothOpenGripDelay;

				if(!GTSbsMode)
					GTModuleStep = 9;
				else
					GTSbsMode = FALSE;
				break;
			case 9:
				if((!GTSbsMode) || GTModMode)
					GTFirstCycle = FALSE;
				if(!GTBothOpenGripDelayCounter)
				{
					GTModuleStep = 0;
					// Step 0
					GTFPushPneuValve = FALSE;
					GTInFillGripPneuValve = TRUE;	// Grip Open
					GTTransferPneuValve = FALSE;

					GTOutFillOpenPneuValve = FALSE;
					GTOutFillGripPneuValve = TRUE;	// Grip Open

					GTModMode = FALSE;
				}
				break;
		}
	}

	if(GTFPushPneuValveDurationCounter)
		GTFPushPneuValveDurationCounter--;

	if(GTCloseBagDelayCounter)
	{
		GTCloseBagDelayCounter--;
		if(!GTCloseBagDelayCounter)
			GTOutFillOpenPneuValve = FALSE;  // Close Bag
	}

	if(GTBothOpenGripDelayCounter)
		GTBothOpenGripDelayCounter--;
	/* Grip & Transfer Module ^ */

	/* Filling Module v */
	if(MachineRunning || OFSbsMode || OFModMode)
	{
		switch(OFModuleStep)
		{
			case 0: // Standby
				OFGatePneuValve	= FALSE;
				OFEngagePneuValve = FALSE;
				OFOpenPneuValve = FALSE;
				OFVacuumValve = FALSE;
				VFVibEngagePneuValve = FALSE;
				VFVibrator = FALSE;
				if(MachineRunning && (!MachineStopping))
				{
					if( (!OFGatePneuRetSensor) && (!OFEngagePneuRetSensor) && (!OFOpenPneuRRetSensor) && (!OFOpenPneuLRetSensor) && (!VFVibEngagePneuRetSensor) )
					{
						if(!OFSbsMode)
							OFModuleStep = 1;
						else
							OFSbsMode = FALSE;
					}
				}
				break;
			case 1: // Receiving from GTModule, Extend the engage and open pneu to locate vacuum into position
				if(GTSA1ModuleWaiting)// || MachineStopping)
				{
					OFGatePneuValve	= FALSE;
					OFEngagePneuValve = TRUE;
					OFOpenPneuValve = TRUE;
					OFVacuumValve = FALSE;
					VFVibEngagePneuValve = FALSE;
					VFVibrator = FALSE;
					if((!OFEngagePneuExtSensor) && (!OFOpenPneuRExtSensor) && (!OFOpenPneuLExtSensor))
					{
						if(!OFSbsMode)
							OFModuleStep = 2;
						else
							OFSbsMode = FALSE;
					}
				}
				break;
			case 2:	// Activate Vacuum
				OFGatePneuValve	= FALSE;
				OFEngagePneuValve = TRUE;
				OFOpenPneuValve = TRUE;
				OFVacuumValve = TRUE;
				VFVibEngagePneuValve = FALSE;
				VFVibrator = FALSE;
				if(!OFVacuumValveDelayCounter)
				{
					OFVacuumValveDelayCounter = OFVacuumValveDelay + 1;
					if(!OFSbsMode)
						OFModuleStep = 3;
					else
						OFSbsMode = FALSE;
				}
				break;
			case 3:	// Vacuum is sure in effect now
				if(!OFVacuumValveDelayCounter)
				{
					GTSA1ModuleWaiting = FALSE;
					OFModuleWaiting = TRUE;

					if(!OFSbsMode)
						OFModuleStep = 4;
					else
					OFSbsMode = FALSE;
					// GTSA2 GRIP HERE
				}
				break;
			case 4:	// Open the bag (Step 1)& Ready the vibrator
				if((!OFModuleWaiting)) //|| MachineStopping)
				{
					OFGatePneuValve	= FALSE;
					OFEngagePneuValve = TRUE;
					OFOpenPneuValve = FALSE;		// Open the bag
					OFVacuumValve = TRUE;
					VFVibEngagePneuValve = TRUE;	// Engage the Vibrator
					VFVibrator = FALSE;
					if( (!OFOpenPneuRRetSensor) && (!OFOpenPneuLRetSensor))
					{
						if(!OFSbsMode)
							OFModuleStep = 5;
						else
							OFSbsMode = FALSE;
					}
				}
				break;
			case 5:	// Open the bag (Step 2)& Ready the vibrator
				OFGatePneuValve	= FALSE;
				OFEngagePneuValve = FALSE;		// Open the bag further
				OFOpenPneuValve = FALSE;

				VFVibEngagePneuValve = TRUE;	// Engage the Vibrator
				VFVibrator = FALSE;
				if( (!OFEngagePneuRetSensor) && (!VFVibEngagePneuExtSensor))
				{
					OFVacuumValve = FALSE;
					if(!OFSbsMode)
						OFModuleStep = 6;
					else
						OFSbsMode = FALSE;
				}
				break;
			case 6:	// Open the BRIDGE to initiate FILLING PROCESS
				if(GTRequestFilling || MachineStopping)
				{
					OFGatePneuValve	= TRUE;			// Thrust the Gate Tongue
					OFEngagePneuValve = FALSE;
					OFOpenPneuValve = FALSE;
					OFVacuumValve = FALSE;
					VFVibEngagePneuValve = TRUE;
					VFVibrator = FALSE;
					if(!OFGatePneuExtSensor)
					{
						if(!OFSbsMode)
							OFModuleStep = 7;
						else
							OFSbsMode = FALSE;
					}
				}
				break;
			case 7:	// Start FILLING when weigher module READY
				if(MachineStopping)
				{
					OFModuleStep = 8;
				}
				if(WLCLWeightOK || WLCRWeightOK)
				{
					OFRequestFilling = TRUE;
					VFVibrator = TRUE;				// Start Vibrating
					if(!OFSbsMode)
						OFModuleStep = 8;
					else
						OFSbsMode = FALSE;
				}
				break;
			case 8:	// Close the gate after finished & Stop Vibrating, tell GT to continue
				if( (!OFGatePneuValveDurationCounter) && (!WLOpGatePneuDurationCounter) && (!WROpGatePneuDurationCounter) )
				{
					GTRequestFilling = FALSE;			// Finished Filling, tell GT to continue

					OFGatePneuValve	= FALSE;			// Close the gate
					OFEngagePneuValve = FALSE;
					OFOpenPneuValve = FALSE;
					OFVacuumValve = FALSE;
					VFVibEngagePneuValve = FALSE;
					VFVibrator = FALSE;					// Stop Vibrating
					if( (!OFGatePneuRetSensor) && (!VFVibEngagePneuRetSensor) )
					{
						//OFGatePneuFilled = FALSE;
						if(!OFSbsMode)
							OFModuleStep = 9;
						else
							OFSbsMode = FALSE;
					}
				}
				break;
			case 9:	// back to module step 0
				OFGatePneuValve	= FALSE;
				OFEngagePneuValve = FALSE;
				OFOpenPneuValve = FALSE;
				OFVacuumValve = FALSE;
				VFVibEngagePneuValve = FALSE;
				VFVibrator = FALSE;
				if(!OFSbsMode)
					OFModuleStep = 0;
				else
					OFSbsMode = FALSE;
				break;
		}
	}

	if(OFVacuumValveDelayCounter)
		OFVacuumValveDelayCounter--;
	/* Filling Module ^ */

	/* Sealing Module v */
	if(MachineRunning || SPSbsMode || SPModMode)
	{
		switch(SPModuleStep)
		{
			case 0: // Standby
				//SPSealerPneuValve		= FALSE; 	// Sealer Opened
				SPVibEngagePneuValve	= FALSE;	// Vibrator Disengaged
				SPPusherValve			= TRUE;		// Pusher Extended
				SPVibrator				= FALSE;	// Vibrator OFF
				if(MachineRunning && (!MachineStopping))
				{
					if( (!SPVibEngagePneuRetSensor) && (!SPSealerPneuRetSensor) && (!SPPusherPneuExtSensor))
					{
						if(!SPSbsMode)
							SPModuleStep = 1;
						else
							SPSbsMode = FALSE;
					}
				}
				break;
			case 1: // Bag from GT is in Place
				if(GTSA2ModuleWaiting)// || MachineStopping)
				{
					SPSealerPneuValveDelayCounter = SPSealerPneuValveDelay + 1;	// Sealer controlled by timing
					//SPSealerPneuValve		= TRUE; 	// Sealer Closed
					SPVibEngagePneuValve	= FALSE;
					SPPusherValve			= FALSE;	// Pusher Retracted so VibEngage can be ext
					SPVibrator				= FALSE;
					if(!SPPusherPneuRetSensor)
					{
						GTSA2ModuleWaiting 		= FALSE;			// Tell GT Module SA 2 to continue
						if(!SPSbsMode)
							SPModuleStep = 2;
						else
							SPSbsMode = FALSE;
					}
				}
				break;
			case 2:	// Engage the vibrator
				//SPSealerPneuValve		= TRUE; 	// Sealer still Closed
				SPVibEngagePneuValve	= TRUE;		// Start engaging
				SPPusherValve			= FALSE;
				SPVibrator				= FALSE;
				if(!SPVibEngagePneuExtSensor)
				{
					if(!SPSbsMode)
						SPModuleStep = 3;
					else
						SPSbsMode = FALSE;
				}
				break;
			case 3: // Vibrate
				//SPSealerPneuValve		= TRUE; 	// Sealer still Closed
				SPVibEngagePneuValve	= TRUE;
				SPPusherValve			= FALSE;
				SPVibrator				= TRUE;		// Vibrator ON
				if(!SPSbsMode)
					SPModuleStep = 4;
				else
					SPSbsMode = FALSE;
				break;
			case 4: // Open Sealer & Turn Off Vibrator
				//SPSealerPneuValve		= FALSE; 	// Start Opening
				SPVibEngagePneuValve	= TRUE;
				SPPusherValve			= FALSE;
				SPVibrator				= FALSE;	// Vibrator OFF
				if(!SPSealerPneuRetSensor)
				{
					if(!SPSbsMode)
						SPModuleStep = 5;
					else
						SPSbsMode = FALSE;
				}
				break;
			case 5: // Bring the VibEngagePneu down with the bag
				//SPSealerPneuValve		= FALSE; 	// Sealer Opened
				SPVibEngagePneuValve	= FALSE;	// Start disengaging
				SPPusherValve			= FALSE;
				SPVibrator				= FALSE;	// Vibrator OFF
				if(!SPVibEngagePneuRetSensor)
				{
					if(!SPSbsMode)
						SPModuleStep = 6;
					else
						SPSbsMode = FALSE;
				}
				break;
			case 6: // Push the bag out to conveyor
				//SPSealerPneuValve		= FALSE;
				SPVibEngagePneuValve	= FALSE;	// Vib is disengaged
				SPPusherValve			= TRUE;		// Pusher start pushing
				SPVibrator				= FALSE;	// Vibrator OFF
				if(!SPPusherPneuExtSensor)
				{
					if(!SPSbsMode)
						SPModuleStep = 7;
					else
						SPSbsMode = FALSE;
				}
				break;
			case 7:  // back to standby position
				SPModuleStep = 0;
				// Step 0
				SPVibEngagePneuValve	= FALSE;	// Vibrator Disengaged
				SPPusherValve			= TRUE;		// Pusher Extended
				SPVibrator				= FALSE;	// Vibrator OFF
				break;
		}
	}

	if(SPSealerPneuValveDelayCounter)
	{
		SPSealerPneuValveDelayCounter--;
		if(!SPSealerPneuValveDelayCounter)
		{
			SPSealerPneuValveDurationCounter = SPSealerPneuValveDuration;
		}
	}
	if(SPSealerPneuValveDurationCounter)
	{
		SPSealerPneuValveDurationCounter--;
		SPSealerPneuValve = TRUE;
		if(!SPSealerPneuValveDurationCounter)
		{

