Aquawhite/LM3S5R31-TwinWeigher/New Twin Weigher V1.0.c
		}
	}
	else
		SPSealerPneuValve = FALSE;
	/* Sealing Module ^ */

	/* Weigher Module v */
    // Loadcell Calibration v
    if(WLCLCalibrationMode == 1)
    {
        WLCLSDAReadingZero = WLCLSDAReadingAverage;
        WLCLCalibrationMode = 0;
    }
    else if(WLCLCalibrationMode == 2)
    {
    	WLCLSDAReadingCustomKg = WLCLSDAReadingAverage;
    	WLCLSDARatioCustomKgCO = ((WLCLSDAReadingCustomKg - WLCLSDAReadingZero) * 250) / WCustomKg;
    	WLCLSDAReadingOffsetCO = ((WLCLSDAReadingZero * 250) / WLCLSDARatioCustomKgCO);
    	WLCLCalibrationMode = 0;
    	WLCLCalibrationFlagCounter = 20;
    }

    if(WLCRCalibrationMode == 1)
    {
        WLCRSDAReadingZero = WLCRSDAReadingAverage;
        WLCRCalibrationMode = 0;
    }
    else if(WLCRCalibrationMode == 2)
    {
    	WLCRSDAReadingCustomKg = WLCRSDAReadingAverage;
    	WLCRSDARatioCustomKgCO = ((WLCRSDAReadingCustomKg - WLCRSDAReadingZero) * 250) / WCustomKg;
    	WLCRSDAReadingOffsetCO = ((WLCRSDAReadingZero * 250) / WLCRSDARatioCustomKgCO);
    	WLCRCalibrationMode = 0;
    	WLCRCalibrationFlagCounter = 20;
    }
    // Loadcell Calibration ^

    // Loadcell Zeroing v
    if(WLCLOnZeroingBtn)
    {
    	WLCLSDARatioCustomKgCO = WLCLSDARatioCustomKg;
    	WLCLSDAReadingOffsetCO = ((WLCLSDAReadingAverage * 250) / WLCLSDARatioCustomKg);
    	WLCLOnZeroingBtn = FALSE;
    	WLCLCalibrationFlagCounter = 20;
    }

    if(WLCROnZeroingBtn)
    {
    	WLCRSDARatioCustomKgCO = WLCRSDARatioCustomKg;
    	WLCRSDAReadingOffsetCO = ((WLCRSDAReadingAverage * 250) / WLCRSDARatioCustomKg);
    	WLCROnZeroingBtn = FALSE;
    	WLCRCalibrationFlagCounter = 20;
    }
    // Loadcell Zeroing ^

    // Filtering Weight OK for 200ms v
    if(WLCLWeightOKFlag)
    {
        if(WLCLWeightOKCounter)
        {
        	WLCLWeightOKCounter--;
            if(!WLCLWeightOKCounter)
            {
            	WLCLWeightOK = TRUE;
            }
        }
    }
    else
    	WLCLWeightOKCounter = 200;

    if(WLCRWeightOKFlag)
      {
          if(WLCRWeightOKCounter)
          {
        	  WLCRWeightOKCounter--;
              if(!WLCRWeightOKCounter)
              {
            	  WLCRWeightOK = TRUE;
              }
          }
      }
      else
    	  WLCRWeightOKCounter = 200;
    // Filtering Weight OK for 200ms ^

    if(WLOpGatePneuDurationCounter)
    {
    	WLOpGatePneuDurationCounter--;
		WLOpGatePneuValve = TRUE;
    	if(!WLOpGatePneuDurationCounter)
    	{
    		WNextOpGateDelayCounter = WNextOpGateDelay + 1;
    		WLCLWeightOKFlag = FALSE;
    		WLCLWeightOK = FALSE;
    		//OFGatePneuFilled = TRUE;
    		//OFGatePneuFillingProcess = FALSE;
    	}
    }
    else
    	WLOpGatePneuValve = FALSE;

    if(WROpGatePneuDurationCounter)
    {
    	WROpGatePneuDurationCounter--;
		WROpGatePneuValve = TRUE;
    	if(!WROpGatePneuDurationCounter)
    	{
    		WNextOpGateDelayCounter = WNextOpGateDelay + 1;
    		WLCRWeightOKFlag = FALSE;
    		WLCRWeightOK = FALSE;
    		//OFGatePneuFilled = TRUE;
    		//OFGatePneuFillingProcess = FALSE;
    	}
    }
    else
    	WROpGatePneuValve = FALSE;

    if(WNextOpGateDelayCounter)
    	WNextOpGateDelayCounter--;
	/* Weigher Module ^ */

	if(ProductCountBitCounter)
	{
		ProductCountBit = TRUE;
		ProductCountBitCounter--;
	}
	else
		ProductCountBit = FALSE;


	/* Input Page : PROX 2 (Must use SVE-MBTIu)
	if(DatesensEN)
	{
		if(ROM_GPIOPinRead(PIN_DATECODE_SENSOR_BASE, PIN_DATECODE_SENSOR_PIN))            // PINDATESENS if the sensor doesnt pick the film
		{
			if(DatesensCounter)
				DatesensCounter--;
			else
				DatesensError = TRUE;
		}
		else
		{
			DatesensCounter = 500;
			DatesensError = FALSE;
		}
	}
	else
	{
		DatesensCounter = 500;
		DatesensError = FALSE;
	}
	 Input Page ^ */

	/* Communication Module v */
	if(ReadACK)                                                         // ReadACK time out 1500 ms
	{                                                                   // if doesnt transfer during 1500 ms then terminate transfer
		if(ReadACKCounter)
			ReadACKCounter--;
		else
		{
			DataLock = FALSE;
			ReadACK = FALSE;
			dataTXIndex = 0;
		}
	}
	else
		ReadACKCounter = 1000;

	if(!ReadACK)     				// if reading mode
	{
		UARTTimeOut--;
		if(!UARTTimeOut)
		{
		    // Disable the Uart to be re-enabled
		    UARTDisable(UART0_BASE);
		    UARTDisabled = TRUE;
		    UARTTimeOut = UARTDISABLEDCOUNT;
		}
	}
	else
		UARTTimeOut = UARTDISABLEDCOUNT;

    if(!SPIStartTimer)
    {
		if(SPIDataReady && (!SPITransmitted))
		{
			//PORTSS = FALSE;
			SSIDataPutNonBlocking(SSI0_BASE, SPIOut[SPICounter]);//SPDR = SPIOut[SPICounter];
			SPITransmitted = TRUE;
		}
    }
    else
        SPIStartTimer--;
	/* Communication Module ^ */

    /* External Heater Module v */
	if(ROM_GPIOPinRead(PIN_HEATER_ERROR_BASE, PIN_HEATER_ERROR_PIN))                                                  // If heater not ready pin is ON
	{
		HeaterErrorCounter = 3000;
		HeaterError = FALSE;
	}
	else
	{
		if(HeaterErrorCounter)
			HeaterErrorCounter--;
		else
		{
			HeaterErrorMsgDuration = 80;
			HeaterError = TRUE;
		}
	}
	/* External Heater Module ^ */

	// 10 ms timer Zone
	if(!ms10counter)
	{
		/* Air Check Subroutine v */
        if(!IgnoreAirError)
        {
        	if(ROM_GPIOPinRead(PIN_AIR_ERROR_BASE, PIN_AIR_ERROR_PIN))
        	{
        		if(NoAirErrorCounter)
        			NoAirErrorCounter--;
        		else
                {
                	NoAirError = TRUE;
                	NoAirErrorMsgDuration = 80;
                }
        	}
            else
            {
            	NoAirError = FALSE;
                NoAirErrorCounter = 20;
            }
        }
        else
        {
        	NoAirErrorCounter = 20;
        	NoAirError = FALSE;
        }
        /* Air Check Subroutine ^ */

        /* Weigher Calibration Subroutine v */
        if(WLCLCalibrationFlagCounter)
        {
        	WLCLCalibrationFlagCounter--;
        	WLCLCalibrationFlag = TRUE;
        }
        else
        	WLCLCalibrationFlag = FALSE;

        if(WLCRCalibrationFlagCounter)
        {
        	WLCRCalibrationFlagCounter--;
        	WLCRCalibrationFlag = TRUE;
        }
        else
        	WLCRCalibrationFlag = FALSE;
        /* Weigher Calibration Subroutine ^ */

		ms10counter = 9;
	}
	else
		ms10counter--;

	// 10 ms timer Zone
	if(!ms100counter)
	{
		// To detect if it resets (Counting how long since turned ON)
		LifeDuration++;

		if(UARTDisabled)
		{
		    // Enable the UART.
		    UARTEnable(UART0_BASE);

