Aquawhite/LM3S5R31-TwinWeigher/New Twin Weigher V1.0.c
            ComOUT[52] = ITSwitchTrayStep;
            ComOUT[53] = TRModuleStep;
            ComOUT[54] = TRVacuumValveDelayCounter / 10;
            ComOUT[55] = GTModuleStep;
            ComOUT[56] = GTCloseBagDelayCounter / 10;
            ComOUT[57] = GTBothOpenGripDelayCounter / 10;
            ComOUT[58] = OFModuleStep;
            ComOUT[59] = OFGatePneuValveDurationCounter / 10;
            ComOUT[60] = OFVacuumValveDelayCounter / 10;
            ComOUT[61] = SPModuleStep;
            ComOUT[62] = SPSealerPneuValveDelayCounter / 10;
            ComOUT[63] = SPSealerPneuValveDurationCounter / 10;
            ComOUT[64] = WLOpGatePneuDurationCounter / 10;
            ComOUT[65] = WROpGatePneuDurationCounter / 10;

            ComOUT[66] = WNextOpGateDelayCounter / 10;
            ComOUT[67] = WLCLSDARatioCustomKgCO >> 24;			// Com Out
            ComOUT[68] = WLCLSDARatioCustomKgCO >> 16;			// Com Out
            ComOUT[69] = WLCLSDARatioCustomKgCO >> 8;			// Com Out
            ComOUT[70] = WLCLSDARatioCustomKgCO;				// Com Out
            ComOUT[71] = WLCRSDARatioCustomKgCO >> 24;
            ComOUT[72] = WLCRSDARatioCustomKgCO >> 16;
            ComOUT[73] = WLCRSDARatioCustomKgCO >> 8;
			ComOUT[74] = WLCRSDARatioCustomKgCO;

			ComOUT[75] = WLCLSDAReadingOffsetCO >> 24;
			ComOUT[76] = WLCLSDAReadingOffsetCO >> 16;
			ComOUT[77] = WLCLSDAReadingOffsetCO >> 8;
			ComOUT[78] = WLCLSDAReadingOffsetCO;
			ComOUT[79] = WLCRSDAReadingOffsetCO >> 24;
			ComOUT[80] = WLCRSDAReadingOffsetCO >> 16;
			ComOUT[81] = WLCRSDAReadingOffsetCO >> 8;
			ComOUT[82] = WLCRSDAReadingOffsetCO;

			ComOUT[83] = WLCLDispWeight >> 24;
			ComOUT[84] = WLCLDispWeight >> 16;
			ComOUT[85] = WLCLDispWeight >> 8;
			ComOUT[86] = WLCLDispWeight;
			ComOUT[87] = WLCRDispWeight >> 24;
			ComOUT[88] = WLCRDispWeight >> 16;
			ComOUT[89] = WLCRDispWeight >> 8;
			ComOUT[90] = WLCRDispWeight;

			ComOUT[91] = WLCLSDAReading >> 24;
			ComOUT[92] = WLCLSDAReading >> 16;
			ComOUT[93] = WLCLSDAReading >> 8;
			ComOUT[94] = WLCLSDAReading;
			ComOUT[95] = WLCRSDAReading >> 24;
			ComOUT[96] = WLCRSDAReading >> 16;
			ComOUT[97] = WLCRSDAReading >> 8;
			ComOUT[98] = WLCRSDAReading;

			ComOUT[99] = GTFPushPneuValveDurationCounter / 10;

			ComOUT[101] = LoopTime >> 8;
			ComOUT[102] = LoopTime;
			ComOUT[103] = LifeDuration >> 24;
			ComOUT[104] = LifeDuration >> 16;
			ComOUT[105] = LifeDuration >> 8;
			ComOUT[106] = LifeDuration;
			ComOUT[107] = 10;				// Program Version
            // OUT : END
            ComOUT[108] = 0x0F;
            ComOUT[109] = 0x0F;
            DataReady = TRUE;
        }

    	// SPI Communication Subroutine
        if(!SPIDataLock)
        {
            SPIDataReady = FALSE;
            SPIOut[0] = 0xF0;
            SPIOut[1] = 0x64;
            SPIOut[2] = 0x04;
            SPIOut[3] = ITMotorTrayElevator + ( ITMotorTrayElevatorDir << 1 ) + ( ITValveTrayPos << 2 );
            SPIOut[4] = GTInFillGripPneuValve + ( GTOutFillOpenPneuValve << 1 ) + ( GTOutFillGripPneuValve << 2 ) + ( GTTransferPneuValve << 3 );
            SPIOut[5] = VFVibEngagePneuValve + ( VFVibrator << 1 );
            SPIOut[6] = SPVibEngagePneuValve + ( SPPusherValve << 1 ) + ( SPVibrator << 2 );
            SPIOut[7] = BufferSensor >> 8;
            SPIOut[8] = BufferSensor;
            SPIOut[24] = 0x0F;
            SPIOut[25] = 0x0F;
            SPIDataReady = TRUE;
        }
    }
}
